In [70]:
# import
import numpy
import matplotlib.pyplot as plt
import networkx
import pandas
import seaborn; seaborn.set()

# series; data in the cloumn
s =pd.Series([1,2,3,np.nan,6,8])
s

0     1
1     2
2     3
3   NaN
4     6
5     8
dtype: float64

In [7]:
A = np.random.randn(6,4)
A

array([[-0.08681685, -1.00103608,  0.70962316, -1.16491955],
       [ 0.12792058,  0.36714846,  1.90813294, -1.37049091],
       [ 0.30121881,  1.45386552, -0.19635327,  1.42651422],
       [-0.32602483, -0.86264082,  0.60372806,  1.54695393],
       [ 0.43497024,  1.10652667,  0.75692862, -0.36893245],
       [ 0.96546065, -0.55769968,  0.83253578,  1.98010769]])

In [12]:
pandas.DataFrame(A, columns =["age", "height", "weight", "color"],
                index = ["a", "b", "c", "d", "e", "f"])

        age    height    weight     color
a -0.086817 -1.001036  0.709623 -1.164920
b  0.127921  0.367148  1.908133 -1.370491
c  0.301219  1.453866 -0.196353  1.426514
d -0.326025 -0.862641  0.603728  1.546954
e  0.434970  1.106527  0.756929 -0.368932
f  0.965461 -0.557700  0.832536  1.980108

In [14]:
df2 = pd.DataFrame({ 'A' : 1.,
   ....:                      'B' : pd.Timestamp('20130102'),
   ....:                      'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
   ....:                      'D' : np.array([3] * 4,dtype='int32'),
   ....:                      'E' : pd.Categorical(["test","train","test","train"]),
   ....:                      'F' : 'foo' })
df2

   A          B  C  D      E    F
0  1 2013-01-02  1  3   test  foo
1  1 2013-01-02  1  3  train  foo
2  1 2013-01-02  1  3   test  foo
3  1 2013-01-02  1  3  train  foo

In [15]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E            object
F            object
dtype: object

In [16]:
df2.columns

Index([u'A', u'B', u'C', u'D', u'E', u'F'], dtype='object')

In [17]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [22]:
for column_name in df2.columns:
    print(column_name)

A
B
C
D
E
F

In [26]:
for row_name in df2.index:
    print(row_name)

0
1
2
3

In [28]:
df2.A

0    1
1    1
2    1
3    1
Name: A, dtype: float64

In [29]:
df2["A"]

0    1
1    1
2    1
3    1
Name: A, dtype: float64

In [52]:
df2["T"]=[1,7,"bob", "joe"]

In [53]:
df2

   A          B  C  D      E    F    T
0  1 2013-01-02  1  3   test  foo    1
1  1 2013-01-02  1  3  train  foo    7
2  1 2013-01-02  1  3   test  foo  bob
3  1 2013-01-02  1  3  train  foo  joe

In [54]:
df2.T

,0,1,2,3
A,1,1,1,1
B,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00
C,1,1,1,1
D,3,3,3,3
E,test,train,test,train
F,foo,foo,foo,foo
T,1,7,bob,joe

In [55]:
df2.max()

A                      1
B    2013-01-02 00:00:00
C                      1
D                      3
E                  train
F                    foo
T                    joe
dtype: object

In [56]:
df2.max(axis=1)

0    3
1    3
2    3
3    3
dtype: float64

In [57]:
df2.mean(axis=0)

A    1
C    1
D    3
dtype: float64

In [58]:
df2.mean(axis=1)

0    1.666667
1    1.666667
2    1.666667
3    1.666667
dtype: float64

In [59]:
df2.head(1)

   A          B  C  D     E    F  T
0  1 2013-01-02  1  3  test  foo  1

In [60]:
df2.tail(2)

   A          B  C  D      E    F    T
2  1 2013-01-02  1  3   test  foo  bob
3  1 2013-01-02  1  3  train  foo  joe

In [62]:
df2.loc[0,:]

A                      1
B    2013-01-02 00:00:00
C                      1
D                      3
E                   test
F                    foo
T                      1
Name: 0, dtype: object

In [63]:
df2.loc[1,:]

A                      1
B    2013-01-02 00:00:00
C                      1
D                      3
E                  train
F                    foo
T                      7
Name: 1, dtype: object

In [64]:
df2.loc[:,"D"]

0    3
1    3
2    3
3    3
Name: D, dtype: int32

In [66]:
df2.loc[[0,1],["C", "D"]]

   C  D
0  1  3
1  1  3